<template>
    <div style="padding-top:20px;padding-left:20px;">
      <el-row class="warp">
        <el-col :span="24">
          <el-card style="width:1200px; height:600px; ">
            <BadPChart  id="myChart" width="1200px" height="600px"  :xAxisValue="xAxisValue" :UCLValue="UCLValue" :LCLValue="LCLValue" :CLValue="CLValue" :PValue="PValue" ></BadPChart>
          </el-card>
          <el-card style="width:1200px; height:600px;  margin-top: 30px;">
            <OKPChart  id="myChart2" width="1200px" height="600px"  :xAxisValue="xAxisValue" :CLValue="CLValue" :PValue="PValue" ></OKPChart>
          </el-card>
          <el-card style="width:1200px; height:600px; float: left; margin-top: 30px; margin-bottom: 30px;">
            <ParetoChart  id="myChart3" width="1230px" height="600px"  :xAxisValue="xAxisValue2"  :PValue="PLA" ></ParetoChart>
          </el-card>
        </el-col>
      </el-row>
    </div>
</template>
<script>
  import  BadPChart from "../../../components/Chart/BadPChart";
  import  OKPChart from "../../../components/Chart/OKPChart";
  import  ParetoChart from "../../../components/Chart/ParetoChart";
  export default {
    data() {
      return {
        xAxisValue:['12:05:00','12:05:00','12:05:00','12:05:00','12:05:00','12:05:00','12:05:00','12:05:00','12:05:00','12:05:00','12:05:00','12:05:00','12:05:00','12:05:00','12:05:00','12:05:00','12:05:00','12:05:00','12:05:00','12:05:00','12:05:00'],
        UCLValue:[0.2819828474098531,
          0.2786618272718163,
          0.2825661084347509,
          0.2814084461414608,
          0.2825661084347509,
          0.2797362185814405,
          0.2786618272718163,
          0.2802853423789895,
          0.31996914117187946,
          0.3306352589466686,
          0.3273602560367157,
          0.3227998499865773,
          0.3186109988017408,
          0.328972692606334,
          0.3186109988017408,
          0.3227998499865773,
          0.3242760608862083,
          0.3257954796475745,
          0.3242760608862083,
          0.3323506075953926
        ],
        LCLValue:[0.05509580427554017,
          0.0584168244135769,
          0.054512543250642365,
          0.05567020554393243,
          0.054512543250642365,
          0.05734243310395279,
          0.0584168244135769,
          0.05679330930640375,
          0.017109510513513754,
          0.006443392738724629,
          0.009718395648677574,
          0.014278801698815985,
          0.018467652883652458,
          0.008105959079059255,
          0.018467652883652458,
          0.014278801698815985,
          0.01280259079918497,
          0.011283172037818756,
          0.01280259079918497,
          0.004728044090000688
        ],
        CLValue:0.17,
        PValue:[0.20408163265306123,
          0.17307692307692307,
          0.14432989690721648,
          0.16161616161616163,
          0.13402061855670103,
          0.28431372549019606,
          0.20192307692307693,
          0.13861386138613862,
          0.10909090909090908,
          0.125,
          0.14,
          0.1320754716981132,
          0.16071428571428573,
          0.10204081632653061,
          0.14285714285714285,
          0.16981132075471697,
          0.17307692307692307,
          0.19607843137254902,
          0.17307692307692307,
          0.2127659574468085
        ],
        PLA:[100,90,78,70,67,60,56,45,40,37,36,30,29,28,20,15,14,12,8,4],
        xAxisValue2:['窗口毛刺','窗口变形','裂纹','内腔粘料','大面变形','毛刺','鼓泡','沙眼','脏化','顶角缺料','侧面裂纹','侧面粘料','熔接痕','底部缺料','疑似不良','凸台划伤','碰伤','大面毛刺','大面脏污','合模线']
      }
    },
    components:{
      BadPChart,OKPChart,ParetoChart
    }
  }
</script>

<style  scoped>

</style>
